app/Models/AndroidCommonJsonModel.php

    public function getData($jsonID){
        return $this->find($jsonID);
---
SELECT *
FROM `android_common_json`
WHERE `android_common_json`.`json_id` = '1'

    public function viewAndroidCommonJson(){
        return $this->get()->getRow();
---
SELECT *
FROM `android_common_json`