app/Models/AndroidFeedbackModel.php

SELECT *
FROM `android_feedback`
ORDER BY `feedback_id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `android_feedback`
---
    public function viewFeedbackData($params, $perPage){
        $this->orderBy('feedback_id', 'desc');
        if(!empty($params['search_android_feedback'])){
            $searchAndroidFeedback = $params['search_android_feedback'];
            $likeArr = [
                'feedback_code' => $searchAndroidFeedback,
                'feedback_message' => $searchAndroidFeedback,
                'feedback_language' => $searchAndroidFeedback,
                'feedback_date' => $searchAndroidFeedback,
            ];
            $this->orLike($likeArr);
        } else if(!empty($params['search_android_feedback_code'])){
            $searchAndroidFeedbackCode = $params['search_android_feedback_code'];
            $this->where('feedback_code', $searchAndroidFeedbackCode);
        } else if(!empty($params['search_android_feedback_status'])){
            $searchAndroidFeedbackStatus = $params['search_android_feedback_status'];
            $this->where('feedback_status', $searchAndroidFeedbackStatus);
        }
        return $this->paginate($perPage);

SELECT COUNT(*) AS `numrows`
FROM `android_feedback`
---
    public function countFeedbackData($params, $perPage){
        $this->orderBy('feedback_id', 'desc');
        if(!empty($params['search_android_feedback'])){
            $searchAndroidFeedback = $params['search_android_feedback'];
            $likeArr = [
                'feedback_code' => $searchAndroidFeedback,
                'feedback_message' => $searchAndroidFeedback,
                'feedback_language' => $searchAndroidFeedback,
                'feedback_date' => $searchAndroidFeedback,
            ];
            $this->orLike($likeArr);
        } else if(!empty($params['search_android_feedback_code'])){
            $searchAndroidFeedbackCode = $params['search_android_feedback_code'];
            $this->where('feedback_code', $searchAndroidFeedbackCode);
        } else if(!empty($params['search_android_feedback_status'])){
            $searchAndroidFeedbackStatus = $params['search_android_feedback_status'];
            $this->where('feedback_status', $searchAndroidFeedbackStatus);
        }
        return $this->countAllResults($perPage);