app/Models/AndroidAppsModel.php

    public function viewData(){
        return $this->findAll();
---
SELECT *
FROM `android_apps`