app/Models/AndroidBannerModel.php

    public function getData($bannerID){
        return $this->find($bannerID);
---
SELECT *
FROM `android_banner`
WHERE `android_banner`.`banner_id` = '3'

    public function viewBannerData($params, $perPage){
        $this->orderBy('banner_id', 'desc');
        if(!empty($params['search_android_banner'])){
            $searchAndroidBanner = $params['search_android_banner'];
            $likeArr = [
                'banner_title' => $searchAndroidBanner,
                'banner_description' => $searchAndroidBanner,
                'banner_url' => $searchAndroidBanner,
                'banner_button' => $searchAndroidBanner,
            ];
            $this->orLike($likeArr);
        }
        if(!empty($params['search_android_banner_type'])){
            $searchAndroidBannerType = $params['search_android_banner_type'];
            $this->where('banner_type', $searchAndroidBannerType);
        }
        if(!empty($params['search_android_banner_status'])){
            $searchAndroidBannerStatus = $params['search_android_banner_status'];
            $this->where('banner_status', $searchAndroidBannerStatus);
        }
        return $this->paginate($perPage);
---
SELECT *
FROM `android_banner`
ORDER BY `banner_id` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `android_banner`

    public function countBannerData($params, $perPage){
        $this->orderBy('banner_id', 'desc');
        if(!empty($params['search_android_banner'])){
            $searchAndroidBanner = $params['search_android_banner'];
            $likeArr = [
                'banner_title' => $searchAndroidBanner,
                'banner_description' => $searchAndroidBanner,
                'banner_url' => $searchAndroidBanner,
                'banner_button' => $searchAndroidBanner,
            ];
            $this->orLike($likeArr);
        }
        if(!empty($params['search_android_banner_type'])){
            $searchAndroidBannerType = $params['search_android_banner_type'];
            $this->where('banner_type', $searchAndroidBannerType);
        }
        if(!empty($params['search_android_banner_status'])){
            $searchAndroidBannerStatus = $params['search_android_banner_status'];
            $this->where('banner_status', $searchAndroidBannerStatus);
        }
        return $this->countAllResults($perPage);
---
SELECT COUNT(*) AS `numrows`
FROM `android_banner`

    public function viewAndroidBanner(){
        $this->orderBy('banner_id', 'desc');
        return $this->findAll();
---
SELECT *
FROM `android_banner`
ORDER BY `banner_id` DESC