app/Models/AndroidSimcardModel.php

SELECT *
FROM `android_simcard`
ORDER BY `sim_id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `android_simcard`
---
    public function viewSimcardData($params, $perPage){
        $this->orderBy('sim_id', 'desc');
        if(!empty($params['search_android_simcard'])){
            $searchAndroidSimcard = $params['search_android_simcard'];
            $likeArr = [
                'sim_owner' => $searchAndroidSimcard,
                'sim_operator' => $searchAndroidSimcard,
                'sim_number' => $searchAndroidSimcard,
                'sim_imei' => $searchAndroidSimcard,
            ];
            $this->orLike($likeArr);
        } else if(!empty($params['search_android_simcard_type'])){
            $searchAndroidSimcardType = $params['search_android_simcard_type'];
            $this->where('sim_type', $searchAndroidSimcardType);
        } else if(!empty($params['search_android_simcard_status'])){
            $searchAndroidSimcardStatus = $params['search_android_simcard_status'];
            $this->where('sim_status', $searchAndroidSimcardStatus);
        }
        return $this->paginate($perPage);

SELECT COUNT(*) AS `numrows`
FROM `android_simcard`
---
    public function countSimcardData($params, $perPage){
        $this->orderBy('sim_id', 'desc');
        if(!empty($params['search_android_simcard'])){
            $searchAndroidSimcard = $params['search_android_simcard'];
            $likeArr = [
                'sim_owner' => $searchAndroidSimcard,
                'sim_operator' => $searchAndroidSimcard,
                'sim_number' => $searchAndroidSimcard,
                'sim_imei' => $searchAndroidSimcard,
            ];
            $this->orLike($likeArr);
        } else if(!empty($params['search_android_simcard_type'])){
            $searchAndroidSimcardType = $params['search_android_simcard_type'];
            $this->where('sim_type', $searchAndroidSimcardType);
        } else if(!empty($params['search_android_simcard_status'])){
            $searchAndroidSimcardStatus = $params['search_android_simcard_status'];
            $this->where('sim_status', $searchAndroidSimcardStatus);
        }
        return $this->countAllResults($perPage);