app/Models/AndroidRoiModel.php

SELECT *
FROM `android_roi`
WHERE `app_id` = '13'
AND MONTH(app_date) = '08'
AND YEAR(app_date) = '2024'
---
    public function getIncomeDataCurrentMonth($appID){
        $this->where('app_id', $appID);
        $this->where('MONTH(app_date)', date('m'));
        $this->where('YEAR(app_date)', date('Y'));
        return $this->find();

SELECT t.app_id, u.*, sum(t.app_in) as total_in, sum(t.app_out) as total_out, (((sum(t.app_out) * 100 ) / sum(t.app_in)) - 100) as total_roi
FROM `android_roi` `t`
JOIN `android_apps` `u` ON `t`.`app_id` = `u`.`app_id`
GROUP BY `t`.`app_id`
ORDER BY `total_roi` DESC
 LIMIT 5
---
    public function getAllTopApps(){
        $builder = $this->db->table('android_roi t');
        $builder->select('t.app_id, u.*, sum(t.app_in) as total_in, sum(t.app_out) as total_out, (((sum(t.app_out) * 100 ) / sum(t.app_in)) - 100) as total_roi', false);
        $builder->join('android_apps u', 't.app_id = u.app_id');
        $builder->groupBy('t.app_id');
        $builder->orderBy('total_roi', 'DESC');
        $builder->limit(5);
        $query = $builder->get();

SELECT t.app_id, u.*, sum(t.app_in) as total_in, sum(t.app_out) as total_out, (((sum(t.app_out) * 100 ) / sum(t.app_in)) - 100) as total_roi
FROM `android_roi` `t`
JOIN `android_apps` `u` ON `t`.`app_id` = `u`.`app_id`
GROUP BY `t`.`app_id`
ORDER BY `total_roi` ASC
 LIMIT 5
---
    public function getAllDownApps(){
        $builder = $this->db->table('android_roi t');
        $builder->select('t.app_id, u.*, sum(t.app_in) as total_in, sum(t.app_out) as total_out, (((sum(t.app_out) * 100 ) / sum(t.app_in)) - 100) as total_roi', false);
        $builder->join('android_apps u', 't.app_id = u.app_id');
        $builder->groupBy('t.app_id');
        $builder->orderBy('total_roi', 'ASC');
        $builder->limit(5);
        $query = $builder->get();